КАКерамика_моя_старая_база/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПрикладнойЭД</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>СведенияОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СведенияОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОЗакупкеКомиссионером</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/ВидыЭД/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Ограничим список выбора, для того чтобы пользователь мог выбрать виды эд только первичных титулов.
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	// фнс
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ТОРГ12Продавец);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.АктИсполнитель);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.АктНаПередачуПрав);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.СчетФактура);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.КорректировочныйСчетФактура);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.СоглашениеОбИзмененииСтоимостиОтправитель);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.АктОРасхождениях);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.УПД);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.УКД);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.СведенияОЗакупкеКомиссионером);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.СведенияОРеализацииКомиссионером);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.КорректировкаСведенийОЗакупкеКомиссионером);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.КорректировкаСведенийОРеализацииКомиссионером);
	
	// cml
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.СчетНаОплату);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ЗаказТовара);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ОтветНаЗаказ);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ПрайсЛист);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ОтчетОПродажахКомиссионногоТовара);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ОтчетОСписанииКомиссионногоТовара);
	
	// BNCommerceOffering
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ЗапросКоммерческихПредложений);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.КоммерческоеПредложение);
	
	// прочее
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ПроизвольныйЭД);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ПередачаТоваровМеждуОрганизациями);
	ДанныеВыбора.Добавить(Перечисления.ВидыЭД.ВозвратТоваровМеждуОрганизациями);
	
КонецПроцедуры

#КонецОбласти
